{"pageProps":{"post":{"title":"Project Blobfishes submitted to the DigitalOcean MongoDB Hackathon","content":"<!--\nTODO: Place one beautiful (or ugly?) picture here\n-->\n\n<p>As I anticipated in my <a href=\"https://gmacario.github.io/posts/2021-07-17-our-journey-to-do-mongodb-hackathon\">previous post</a> a few days ago I joined the <a href=\"https://www.digitalocean.com/mongodb-hackathon/\">DigitalOcean MongoDB Hackathon</a> together with a group of friends.</p>\n<p>Even though the official objective of joining the Hackathon is to be awarded a prize, I believe all of us shared a few other goals:</p>\n<ol>\n<li>We want to learn and explore new web technologies</li>\n<li>We want to apply best practices which may be useful in our day-to-day jobs...</li>\n<li>But first of all we want to have fun!</li>\n</ol>\n<!--\nWhat are we going to develop and submit to the Hackathon?\nStay tuned, I will shed some light very soon... \n-->\n\n<h2 id=\"what-did-we-eventually-develop\">What did we eventually develop?</h2>\n<p>Let me introduce\n<a href=\"https://github.com/aquariophilie/blobfishes\">https://github.com/aquariophilie/blobfishes</a></p>\n<!-- TODO -->\n\n<h2 id=\"our-journey\">Our journey</h2>\n<p>I learned about the DigitalOcean MongoDB Hackathon when it was launched at the <a href=\"https://deploy.digitalocean.com/\">deploy by DigitalOcean</a> event at the end of June.</p>\n<p>From that day on I kept chasing my friends to join me in this effort, but they were reluctant. I may understand why, they already bear with me during the workday, and having to do the same also during their evenings and week-ends is definitely a demanding effort...</p>\n<h3 id=\"project-blobfishes-kick-off\">Project blobfishes kick-off</h3>\n<p>My friends eventually gave up to my insistence, and on 2021-07-14 we met in person to agree upon what we would develop in order to be awarded with the <a href=\"https://www.digitalocean.com/mongodb-hackathon/#prizes\">wonderful prizes</a> offered by DigitalOcean.</p>\n<p>We soon realized that the time until the closing date of the hackathon (<a href=\"https://www.digitalocean.com/mongodb-hackathon/\">July 20, 2021, 11:59 pm PST</a>) was quite short, therefore we had to cut corners and agreed the scope of work.</p>\n<p>As the <a href=\"TODO\">blobfishes project page on GitHub</a> states</p>\n<blockquote>\n<p>Blobfishes aims to be the ugliest project participating to the <a href=\"https://www.digitalocean.com/mongodb-hackathon/\">DigitalOcean MongoDB Hackathon</a>.</p>\n</blockquote>\n<p>After the kick-off meeting we never had the chance of meeting all together in person again; instead, we relied upon collaboration tools such as <a href=\"https://web.telegram.org/\">Telegram</a> and <a href=\"https://github.com/aquariophilie/blobfishes/issues\">GitHub issues</a> and best practices such as CI/CD and SCRUM.</p>\n<h3 id=\"roles-and-responsibilities\">Roles and responsibilities</h3>\n<p>Based on our skills and interests we also agreed on each <a href=\"https://github.com/aquariophilie/blobfishes/blob/main/docs/rasic.md\">team member role</a>.</p>\n<!-- TODO: Excerpt of the RASI? -->\n\n<p>Hopefully - since I am the eldest and the laziest member of the team - my friends did not ask me to write complex <a href=\"https://docs.mongodb.com/\">MongoDB queries</a> or arcane <a href=\"https://nodejs.org/it/docs/\">Node.js</a> or <a href=\"https://svelte.dev/\">Svelte</a> code.\nInstead, they assigned me the Ops, Deploy and Documentation tasks which are usually neglected by all real developers.</p>\n<p>Like a <a href=\"https://www.quora.com/What-is-the-meaning-of-the-phrase-cherry-on-top#:~:text=A%20%E2%80%9Ccherry%20on%20top%E2%80%9D%20means,cherry%20is%20put%20on%20top.\">cherry on top of the ice cream</a>, I also offered to contribute with my skills of ball-breaker and watchdog which I have refined during my work at <a href=\"https://www.arol.com/\">AROL</a>. That&#39;s why you may notice that I have currently the highest rank in number of open issues - not in resolved ones, though :-(</p>\n<p>Based on the RASI, each member of the team the responsibility to choose the best tool and/or technology to support his tasks, of course after consulting with the others.</p>\n<p>We found it particularly useful to discuss and agree on key project decisions by means of a GitHub issue assigned to the task owner. All knowledgeable people can interact there, discuss options or submit linked PRs with architecture documents, examples, etc. The issue will be closed after documenting the decision in the project repository - either via source code, diagrams or Markdown documents.</p>\n<!-- You may look at issue TODO as an example: decision on the database schema -->\n\n<h2 id=\"the-result\">The result</h2>\n<p>At the end of the day our project setup proved to work well - even at such short notice we eventually <a href=\"https://github.com/aquariophilie/blobfishes/issues/24#issuecomment-883869551\">managed to have our submission accepted</a> just a few hours before the Hackathon closed!</p>\n<h2 id=\"next-steps\">Next steps</h2>\n<p>As it is now about time to go to work here is my short-time action plan:</p>\n<ol>\n<li>Do a <code>git commit</code></li>\n<li>Have all the <a href=\"https://github.com/gmacario/gmacario.github.io/actions\">GitHub checks</a> green</li>\n<li>Merge this PR to have this post <a href=\"https://gmacario.github.io/\">published on my blog</a></li>\n<li>Leave home to arrive at my workplace on time</li>\n</ol>\n<p>For a longer time plan, please have a look at the <a href=\"https://github.com/aquariophilie/blobfishes/projects/1\">blobfishes project dashboard</a>.</p>\n<p>By the way, the blobfishes project is released under an <a href=\"https://github.com/aquariophilie/blobfishes/blob/main/LICENSE\">Open Source license</a>, and contributions are more than welcome!</p>\n<!-- TODO -->\n\n<!-- EOF -->\n"},"config":{"title":"gmacario.github.io","description":"Gianpaolo Macario's public rants","social":{"github":{"name":"gmacario","link":"https://github.com/gmacario"},"twitter":{"name":"gpmacario","link":"https://www.twitter.com/gpmacario"}}}},"__N_SSG":true}